src/InformationRegisters/цур_РеестрВидовМетаданных/цур_РеестрВидовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_РеестрВидовМетаданных</name>
  <resources>
    <name>ИмяКоллекцииМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяДляXML</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяКоллекцииРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлементаРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступныеПрава</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ГруппыВложенных</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>GeneratedTypes</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СинонимМн</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/цур_РеестрМетаданныхСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает описание вида метаданных по его строковому идентификатору.
//
// Параметры:
//  ВидМетаданных - Строка - строковый идентификатор вида (например "Catalog", "Document")
//
// Возврат:
//  Структура - описание вида со следующими ключами:
//   * ВидМетаданных            - Строка
//   * ИмяКоллекцииМетаданных   - Строка - русское имя коллекции (например "Справочники")
//   * ИмяДляXML                - Строка
//   * ИмяКоллекцииРасширения   - Строка
//   * ИмяЭлементаРасширения    - Строка
//   * ДоступныеПрава           - Массив из Строка
//   * ГруппыВложенных          - Массив из Строка
//   * GeneratedTypes            - Соответствие
//   * Порядок                  - Число
//   * Синоним                  - Строка
//   * СинонимМн                - Строка
//  Неопределено - если запись не найдена
//
Функция ОписаниеВида(ВидМетаданных) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реестр.ВидМетаданных КАК ВидМетаданных,
	|	Реестр.ИмяКоллекцииМетаданных КАК ИмяКоллекцииМетаданных,
	|	Реестр.ИмяДляXML КАК ИмяДляXML,
	|	Реестр.ИмяКоллекцииРасширения КАК ИмяКоллекцииРасширения,
	|	Реестр.ИмяЭлементаРасширения КАК ИмяЭлементаРасширения,
	|	Реестр.ДоступныеПрава КАК ДоступныеПрава,
	|	Реестр.ГруппыВложенных КАК ГруппыВложенных,
	|	Реестр.GeneratedTypes КАК GeneratedTypes,
	|	Реестр.Порядок КАК Порядок,
	|	Реестр.Синоним КАК Синоним,
	|	Реестр.СинонимМн КАК СинонимМн
	|ИЗ
	|	РегистрСведений.цур_РеестрВидовМетаданных КАК Реестр
	|ГДЕ
	|	Реестр.ВидМетаданных = &ВидМетаданных";

	Запрос.УстановитьПараметр("ВидМетаданных", ВидМетаданных);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Описание = Новый Структура;
	Описание.Вставить("ВидМетаданных",          Выборка.ВидМетаданных);
	Описание.Вставить("ИмяКоллекцииМетаданных", Выборка.ИмяКоллекцииМетаданных);
	Описание.Вставить("ИмяДляXML",              Выборка.ИмяДляXML);
	Описание.Вставить("ИмяКоллекцииРасширения", Выборка.ИмяКоллекцииРасширения);
	Описание.Вставить("ИмяЭлементаРасширения",  Выборка.ИмяЭлементаРасширения);
	Описание.Вставить("ДоступныеПрава",         РазобратьМассивИзСтрокиФормата(Выборка.ДоступныеПрава));
	Описание.Вставить("ГруппыВложенных",        РазобратьМассивИзСтрокиФормата(Выборка.ГруппыВложенных));
	Описание.Вставить("GeneratedTypes",          РазобратьСоответствиеИзСтрокиФормата(Выборка.GeneratedTypes));
	Описание.Вставить("Порядок",                Выборка.Порядок);
	Описание.Вставить("Синоним",                Выборка.Синоним);
	Описание.Вставить("СинонимМн",              Выборка.СинонимМн);

	Возврат Описание;

КонецФункции

// Возвращает список доступных прав для вида метаданных.
//
// Параметры:
//  ВидМетаданных - Строка - строковый идентификатор вида
//
// Возврат:
//  Массив из Строка - имена доступных прав; пустой массив, если вид не найден
//
Функция ДоступныеПрава(ВидМетаданных) Экспорт

	Описание = ОписаниеВида(ВидМетаданных);

	Если Описание = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Возврат Описание.ДоступныеПрава;

КонецФункции

// Возвращает список групп вложенных объектов для вида метаданных.
//
// Параметры:
//  ВидМетаданных - Строка - строковый идентификатор вида
//
// Возврат:
//  Массив из Строка - имена групп вложенных; пустой массив, если вид не найден
//
Функция ГруппыВложенных(ВидМетаданных) Экспорт

	Описание = ОписаниеВида(ВидМетаданных);

	Если Описание = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Возврат Описание.ГруппыВложенных;

КонецФункции

// Возвращает соответствие сгенерированных типов для вида метаданных.
//
// Параметры:
//  ВидМетаданных - Строка - строковый идентификатор вида
//
// Возврат:
//  Соответствие - разобранное содержимое поля GeneratedTypes;
//                 пустое соответствие, если вид не найден
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция GeneratedTypes(ВидМетаданных) Экспорт
//BSLLS:LatinAndCyrillicSymbolInWord-on

	Описание = ОписаниеВида(ВидМетаданных);

	Если Описание = Неопределено Тогда
		Возврат Новый Соответствие;
	КонецЕсли;

	Возврат Описание.GeneratedTypes;

КонецФункции

// Возвращает все виды метаданных, упорядоченные по полю Порядок.
//
// Возврат:
//  Массив из Структура - каждый элемент имеет ту же структуру, что и результат ОписаниеВида()
//
Функция ВсеВидыМетаданных() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реестр.ВидМетаданных КАК ВидМетаданных,
	|	Реестр.ИмяКоллекцииМетаданных КАК ИмяКоллекцииМетаданных,
	|	Реестр.ИмяДляXML КАК ИмяДляXML,
	|	Реестр.ИмяКоллекцииРасширения КАК ИмяКоллекцииРасширения,
	|	Реестр.ИмяЭлементаРасширения КАК ИмяЭлементаРасширения,
	|	Реестр.ДоступныеПрава КАК ДоступныеПрава,
	|	Реестр.ГруппыВложенных КАК ГруппыВложенных,
	|	Реестр.GeneratedTypes КАК GeneratedTypes,
	|	Реестр.Порядок КАК Порядок,
	|	Реестр.Синоним КАК Синоним,
	|	Реестр.СинонимМн КАК СинонимМн
	|ИЗ
	|	РегистрСведений.цур_РеестрВидовМетаданных КАК Реестр
	|УПОРЯДОЧИТЬ ПО
	|	Реестр.Порядок ВОЗР";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	Результат = Новый Массив;

	Пока Выборка.Следующий() Цикл

		Описание = Новый Структура;
		Описание.Вставить("ВидМетаданных",          Выборка.ВидМетаданных);
		Описание.Вставить("ИмяКоллекцииМетаданных", Выборка.ИмяКоллекцииМетаданных);
		Описание.Вставить("ИмяДляXML",              Выборка.ИмяДляXML);
		Описание.Вставить("ИмяКоллекцииРасширения", Выборка.ИмяКоллекцииРасширения);
		Описание.Вставить("ИмяЭлементаРасширения",  Выборка.ИмяЭлементаРасширения);
		Описание.Вставить("ДоступныеПрава",         РазобратьМассивИзСтрокиФормата(Выборка.ДоступныеПрава));
		Описание.Вставить("ГруппыВложенных",        РазобратьМассивИзСтрокиФормата(Выборка.ГруппыВложенных));
		Описание.Вставить("GeneratedTypes",          РазобратьСоответствиеИзСтрокиФормата(Выборка.GeneratedTypes));
		Описание.Вставить("Порядок",                Выборка.Порядок);
		Описание.Вставить("Синоним",                Выборка.Синоним);
		Описание.Вставить("СинонимМн",              Выборка.СинонимМн);

		Результат.Добавить(Описание);

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Выполняет обратный поиск вида метаданных по русскому имени коллекции.
//
// Параметры:
//  ИмяКоллекции - Строка - русское имя коллекции (например "Справочники", "Документы")
//
// Возврат:
//  Строка      - идентификатор вида метаданных (например "Catalog")
//  Неопределено - если запись не найдена
//
Функция ВидПоИмениКоллекции(ИмяКоллекции) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Реестр.ВидМетаданных КАК ВидМетаданных
	|ИЗ
	|	РегистрСведений.цур_РеестрВидовМетаданных КАК Реестр
	|ГДЕ
	|	Реестр.ИмяКоллекцииМетаданных = &ИмяКоллекции";

	Запрос.УстановитьПараметр("ИмяКоллекции", ИмяКоллекции);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.ВидМетаданных;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Разбирает строку в формате JSON и возвращает массив строк.
// При пустой строке или ошибке разбора возвращает пустой массив.
//
// Параметры:
//  СтрокаФормата - Строка - сериализованный массив строк в формате JSON
//
// Возврат:
//  Массив из Строка
//
Функция РазобратьМассивИзСтрокиФормата(СтрокаФормата)

	Если НЕ ЗначениеЗаполнено(СтрокаФормата) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаФормата);
	Результат = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();

	Если ТипЗнч(Результат) <> Тип("Массив") Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Разбирает строку в формате JSON и возвращает соответствие.
// При пустой строке или ошибке разбора возвращает пустое соответствие.
//
// Параметры:
//  СтрокаФормата - Строка - сериализованный объект в формате JSON
//
// Возврат:
//  Соответствие
//
Функция РазобратьСоответствиеИзСтрокиФормата(СтрокаФормата)

	Если НЕ ЗначениеЗаполнено(СтрокаФормата) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаФормата);

	Результат = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();

	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Возврат Новый Соответствие;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти
